from main import *
def functional_tests():
    data = read_file('1000.csv')
    
    print("Начало тестирования....")
    print("Результаты проверки алгоритма полного перебора: ")
    print("--------------------------------------------------------------------------------------------------------------------------")
    print("\n1) Входной параметр: не пустой массив и Tina Henson") 
    print("Ожидаемый результат: 730. Полученный результат: ", full_iteration(data, 'Tina Henson'))
    print("--------------------------------------------------------------------------------------------------------------------------")
    print("\n2) Входной параметр: пустой массив и Tina Henson")
    print("Ожидаемый результат: None. Полученный результат: ", full_iteration([], 'Tina Henson')) 
    print("--------------------------------------------------------------------------------------------------------------------------")
    print("\n3) Входной параметр: не пустой массив и пустое значение")
    print("Ожидаемый результат: None. Полученный результат: ", full_iteration(data, ''))
    data.sort()
    print("\nПроверка алгоритма двоичного поиска: ")
    print("--------------------------------------------------------------------------------------------------------------------------")
    print("\n1) Входной параметр: не пустой массив и Tina Henson") 
    print("Ожидаемый результат: 948. Полученный результат: ", bin_search(data, 'Tina Henson'))
    print("--------------------------------------------------------------------------------------------------------------------------")
    print("\n2) Входной параметр: пустой массив и Tina Henson")
    print("Ожидаемый результат: None. Полученный результат: ", bin_search([], 'Tina Henson')) 
    print("--------------------------------------------------------------------------------------------------------------------------")
    print("\n3) Входной параметр: не пустой массив и пустое значение")
    print("Ожидаемый результат: None. Полученный результат: ", bin_search(data, ''))
   
    
if __name__ == "__main__":
    functional_tests()